In [1]:
import numpy as np

In [2]:
import pandas as pd

In [17]:
myseries1 = pd.Series([200,400,600],['UK','CANADA','USA'])

In [18]:
myseries1

UK        200
CANADA    400
USA       600
dtype: int64

In [19]:
myseries1['USA']

600

In [20]:
myseries1.keys()

Index(['UK', 'CANADA', 'USA'], dtype='object')

In [21]:
myseries1 * 2

UK         400
CANADA     800
USA       1200
dtype: int64

# DATAFRAMES

In [47]:
np.random.seed(101)
data1 = np.random.randint(0,101,(4,3))

In [48]:
data1

array([[95, 11, 81],
       [70, 63, 87],
       [75,  9, 77],
       [40,  4, 63]])

In [49]:
mycolumns = ['JAN', 'FEB', 'MAR'] #columns

In [53]:
myindex = ['A','B','C','D'] #rows

In [54]:
df = pd.DataFrame(data1,myindex,mycolumns)

In [55]:
df

   JAN  FEB  MAR
A   95   11   81
B   70   63   87
C   75    9   77
D   40    4   63

In [56]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, A to D
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   JAN     4 non-null      int32
 1   FEB     4 non-null      int32
 2   MAR     4 non-null      int32
dtypes: int32(3)
memory usage: 80.0+ bytes

In [57]:
pwd

'E:\\MLPRACTICE\\pandas'

In [58]:
ls

 Volume in drive E is New Volume
 Volume Serial Number is 388B-DAA1

 Directory of E:\MLPRACTICE\pandas

21-06-2023  11:17    <DIR>          .
07-01-2023  11:46    <DIR>          ..
21-06-2023  10:26    <DIR>          .ipynb_checkpoints
05-07-2020  06:09                51 example.csv
13-07-2020  01:11        25,112,317 hotel_booking_data.csv
08-02-2020  00:56               177 movie_scores.csv
02-07-2020  04:26            17,727 mpg.csv
05-07-2020  06:28             5,022 my_excel_file.xlsx
02-01-2023  18:03                51 new_file.csv
31-12-2022  12:45            33,744 pandas-combining-dataframes.ipynb
15-12-2022  18:31            41,853 pandas-conditional-filtering.ipynb
19-12-2022  17:07            99,209 pandas-Dataframes.ipynb
02-01-2023  18:42            16,012 pandas-datetime.ipynb
19-12-2022  17:14            89,118 pandas-functions.ipynb
21-12-2022  15:41            28,112 pandas-functions2.ipynb
06-01-2023  20:31            93,057 pandas-group-by.ipynb
21-12-2022  11:59            34,184 pandas-missing-data.ipynb
21-06-2023  11:17             6,505 pandas-practice.ipynb
04-01-2023  19:52            89,701 Pandas-Project-Exercise .ipynb
02-01-2023  19:01            46,042 pandas-read-write-csv-html-excel.ipynb
19-12-2022  17:14             7,729 pandas-Series.ipynb
02-01-2023  19:29             7,688 pandas-sql_databases.ipynb
31-12-2022  13:36             8,054 pandas-strings.ipynb
03-07-2020  06:26             5,459 RetailSales_BeerWineLiquor.csv
02-01-2023  18:39             1,328 sample_table.html
28-01-2020  02:58            18,752 tips.csv
              23 File(s)     25,761,892 bytes
               3 Dir(s)  445,091,627,008 bytes free

In [59]:
df1 = pd.read_csv("tips.csv")

In [61]:
df1.head(10)

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251
5,25.29,4.71,Male,No,Sun,Dinner,4,6.32,Erik Smith,213140353657882,Sun9679
6,8.77,2.00,Male,No,Sun,Dinner,2,4.38,Kristopher Johnson,2223727524230344,Sun5985
7,26.88,3.12,Male,No,Sun,Dinner,4,6.72,Robert Buck,3514785077705092,Sun8157
8,15.04,1.96,Male,No,Sun,Dinner,2,7.52,Joseph Mcdonald,3522866365840377,Sun6820
9,14.78,3.23,Male,No,Sun,Dinner,2,7.39,Jerome Abbott,3532124519049786,Sun3775

In [64]:
df1.columns

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size',
       'price_per_person', 'Payer Name', 'CC Number', 'Payment ID'],
      dtype='object')

In [66]:
df1.index

RangeIndex(start=0, stop=244, step=1)

In [67]:
df1.describe()

       total_bill         tip        size  price_per_person     CC Number
count  244.000000  244.000000  244.000000        244.000000  2.440000e+02
mean    19.785943    2.998279    2.569672          7.888197  2.563496e+15
std      8.902412    1.383638    0.951100          2.914234  2.369340e+15
min      3.070000    1.000000    1.000000          2.880000  6.040679e+10
25%     13.347500    2.000000    2.000000          5.800000  3.040731e+13
50%     17.795000    2.900000    2.000000          7.255000  3.525318e+15
75%     24.127500    3.562500    3.000000          9.390000  4.553675e+15
max     50.810000   10.000000    6.000000         20.270000  6.596454e+15

# COLUMNS

In [71]:
mycols = ['total_bill', 'tip']
df1[mycols]

     total_bill   tip
0         16.99  1.01
1         10.34  1.66
2         21.01  3.50
3         23.68  3.31
4         24.59  3.61
..          ...   ...
239       29.03  5.92
240       27.18  2.00
241       22.67  2.00
242       17.82  1.75
243       18.78  3.00

[244 rows x 2 columns]